aehoppe/E70N19_Dev_Board/atsame70n19/include/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_ECR_OFFSET                     (0x40)                                        /**<  (MCAN_ECR) Error Counter Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define MCAN_ECR_TEC_Pos                    0                                              /**< (MCAN_ECR) Transmit Error Counter Position */
#define MCAN_ECR_TEC_Msk                    (0xFFU << MCAN_ECR_TEC_Pos)                    /**< (MCAN_ECR) Transmit Error Counter Mask */
#define MCAN_ECR_TEC(value)                 (MCAN_ECR_TEC_Msk & ((value) << MCAN_ECR_TEC_Pos))
#define MCAN_ECR_REC_Pos                    8                                              /**< (MCAN_ECR) Receive Error Counter Position */
#define MCAN_ECR_REC_Msk                    (0x7FU << MCAN_ECR_REC_Pos)                    /**< (MCAN_ECR) Receive Error Counter Mask */
#define MCAN_ECR_REC(value)                 (MCAN_ECR_REC_Msk & ((value) << MCAN_ECR_REC_Pos))
#define MCAN_ECR_RP_Pos                     15                                             /**< (MCAN_ECR) Receive Error Passive Position */
#define MCAN_ECR_RP_Msk                     (0x1U << MCAN_ECR_RP_Pos)                      /**< (MCAN_ECR) Receive Error Passive Mask */
#define MCAN_ECR_RP                         MCAN_ECR_RP_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_ECR_RP_Msk instead */
#define MCAN_ECR_CEL_Pos                    16                                             /**< (MCAN_ECR) CAN Error Logging (cleared on read) Position */
#define MCAN_ECR_CEL_Msk                    (0xFFU << MCAN_ECR_CEL_Pos)                    /**< (MCAN_ECR) CAN Error Logging (cleared on read) Mask */
#define MCAN_ECR_CEL(value)                 (MCAN_ECR_CEL_Msk & ((value) << MCAN_ECR_CEL_Pos))
#define MCAN_ECR_MASK                       (0xFFFFFFU)                                    /**< \deprecated (MCAN_ECR) Register MASK  (Use MCAN_ECR_Msk instead)  */
#define MCAN_ECR_Msk                        (0xFFFFFFU)                                    /**< (MCAN_ECR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- MCAN_PSR : (MCAN Offset: 0x44) (R/ 32) Protocol Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LEC:3;                     /**< bit:   0..2  Last Error Code (set to 111 on read)     */
    uint32_t ACT:2;                     /**< bit:   3..4  Activity                                 */
    uint32_t EP:1;                      /**< bit:      5  Error Passive                            */
    uint32_t EW:1;                      /**< bit:      6  Warning Status                           */
    uint32_t BO:1;                      /**< bit:      7  Bus_Off Status                           */
    uint32_t FLEC:3;                    /**< bit:  8..10  Fast Last Error Code (set to 111 on read) */
    uint32_t RESI:1;                    /**< bit:     11  ESI Flag of Last Received CAN FD Message (cleared on read) */
    uint32_t RBRS:1;                    /**< bit:     12  BRS Flag of Last Received CAN FD Message (cleared on read) */
    uint32_t REDL:1;                    /**< bit:     13  Received a CAN FD Message (cleared on read) */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_PSR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_PSR_OFFSET                     (0x44)                                        /**<  (MCAN_PSR) Protocol Status Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define MCAN_PSR_LEC_Pos                    0                                              /**< (MCAN_PSR) Last Error Code (set to 111 on read) Position */
#define MCAN_PSR_LEC_Msk                    (0x7U << MCAN_PSR_LEC_Pos)                     /**< (MCAN_PSR) Last Error Code (set to 111 on read) Mask */
#define MCAN_PSR_LEC(value)                 (MCAN_PSR_LEC_Msk & ((value) << MCAN_PSR_LEC_Pos))
#define   MCAN_PSR_LEC_NO_ERROR_Val         (0x0U)                                         /**< (MCAN_PSR) No error occurred since LEC has been reset by successful reception or transmission.  */
#define   MCAN_PSR_LEC_STUFF_ERROR_Val      (0x1U)                                         /**< (MCAN_PSR) More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.  */
#define   MCAN_PSR_LEC_FORM_ERROR_Val       (0x2U)                                         /**< (MCAN_PSR) A fixed format part of a received frame has the wrong format.  */
#define   MCAN_PSR_LEC_ACK_ERROR_Val        (0x3U)                                         /**< (MCAN_PSR) The message transmitted by the MCAN was not acknowledged by another node.  */
#define   MCAN_PSR_LEC_BIT1_ERROR_Val       (0x4U)                                         /**< (MCAN_PSR) During the transmission of a message (with the exception of the arbitration field), the device wanted to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant.  */
#define   MCAN_PSR_LEC_BIT0_ERROR_Val       (0x5U)                                         /**< (MCAN_PSR) During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed).  */
#define   MCAN_PSR_LEC_CRC_ERROR_Val        (0x6U)                                         /**< (MCAN_PSR) The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data.  */
#define   MCAN_PSR_LEC_NO_CHANGE_Val        (0x7U)                                         /**< (MCAN_PSR) Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows the value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register.  */
#define MCAN_PSR_LEC_NO_ERROR               (MCAN_PSR_LEC_NO_ERROR_Val << MCAN_PSR_LEC_Pos)  /**< (MCAN_PSR) No error occurred since LEC has been reset by successful reception or transmission. Position  */
#define MCAN_PSR_LEC_STUFF_ERROR            (MCAN_PSR_LEC_STUFF_ERROR_Val << MCAN_PSR_LEC_Pos)  /**< (MCAN_PSR) More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed. Position  */
#define MCAN_PSR_LEC_FORM_ERROR             (MCAN_PSR_LEC_FORM_ERROR_Val << MCAN_PSR_LEC_Pos)  /**< (MCAN_PSR) A fixed format part of a received frame has the wrong format. Position  */
#define MCAN_PSR_LEC_ACK_ERROR              (MCAN_PSR_LEC_ACK_ERROR_Val << MCAN_PSR_LEC_Pos)  /**< (MCAN_PSR) The message transmitted by the MCAN was not acknowledged by another node. Position  */
#define MCAN_PSR_LEC_BIT1_ERROR             (MCAN_PSR_LEC_BIT1_ERROR_Val << MCAN_PSR_LEC_Pos)  /**< (MCAN_PSR) During the transmission of a message (with the exception of the arbitration field), the device wanted to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant. Position  */
#define MCAN_PSR_LEC_BIT0_ERROR             (MCAN_PSR_LEC_BIT0_ERROR_Val << MCAN_PSR_LEC_Pos)  /**< (MCAN_PSR) During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed). Position  */
#define MCAN_PSR_LEC_CRC_ERROR              (MCAN_PSR_LEC_CRC_ERROR_Val << MCAN_PSR_LEC_Pos)  /**< (MCAN_PSR) The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data. Position  */
#define MCAN_PSR_LEC_NO_CHANGE              (MCAN_PSR_LEC_NO_CHANGE_Val << MCAN_PSR_LEC_Pos)  /**< (MCAN_PSR) Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows the value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register. Position  */
#define MCAN_PSR_ACT_Pos                    3                                              /**< (MCAN_PSR) Activity Position */
#define MCAN_PSR_ACT_Msk                    (0x3U << MCAN_PSR_ACT_Pos)                     /**< (MCAN_PSR) Activity Mask */
#define MCAN_PSR_ACT(value)                 (MCAN_PSR_ACT_Msk & ((value) << MCAN_PSR_ACT_Pos))
#define   MCAN_PSR_ACT_SYNCHRONIZING_Val    (0x0U)                                         /**< (MCAN_PSR) Node is synchronizing on CAN communication  */
#define   MCAN_PSR_ACT_IDLE_Val             (0x1U)                                         /**< (MCAN_PSR) Node is neither receiver nor transmitter  */
#define   MCAN_PSR_ACT_RECEIVER_Val         (0x2U)                                         /**< (MCAN_PSR) Node is operating as receiver  */
#define   MCAN_PSR_ACT_TRANSMITTER_Val      (0x3U)                                         /**< (MCAN_PSR) Node is operating as transmitter  */
#define MCAN_PSR_ACT_SYNCHRONIZING          (MCAN_PSR_ACT_SYNCHRONIZING_Val << MCAN_PSR_ACT_Pos)  /**< (MCAN_PSR) Node is synchronizing on CAN communication Position  */
#define MCAN_PSR_ACT_IDLE                   (MCAN_PSR_ACT_IDLE_Val << MCAN_PSR_ACT_Pos)    /**< (MCAN_PSR) Node is neither receiver nor transmitter Position  */
#define MCAN_PSR_ACT_RECEIVER               (MCAN_PSR_ACT_RECEIVER_Val << MCAN_PSR_ACT_Pos)  /**< (MCAN_PSR) Node is operating as receiver Position  */
#define MCAN_PSR_ACT_TRANSMITTER            (MCAN_PSR_ACT_TRANSMITTER_Val << MCAN_PSR_ACT_Pos)  /**< (MCAN_PSR) Node is operating as transmitter Position  */
#define MCAN_PSR_EP_Pos                     5                                              /**< (MCAN_PSR) Error Passive Position */
#define MCAN_PSR_EP_Msk                     (0x1U << MCAN_PSR_EP_Pos)                      /**< (MCAN_PSR) Error Passive Mask */
#define MCAN_PSR_EP                         MCAN_PSR_EP_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_PSR_EP_Msk instead */
#define MCAN_PSR_EW_Pos                     6                                              /**< (MCAN_PSR) Warning Status Position */
#define MCAN_PSR_EW_Msk                     (0x1U << MCAN_PSR_EW_Pos)                      /**< (MCAN_PSR) Warning Status Mask */
#define MCAN_PSR_EW                         MCAN_PSR_EW_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_PSR_EW_Msk instead */
#define MCAN_PSR_BO_Pos                     7                                              /**< (MCAN_PSR) Bus_Off Status Position */
#define MCAN_PSR_BO_Msk                     (0x1U << MCAN_PSR_BO_Pos)                      /**< (MCAN_PSR) Bus_Off Status Mask */
#define MCAN_PSR_BO                         MCAN_PSR_BO_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_PSR_BO_Msk instead */
#define MCAN_PSR_FLEC_Pos                   8                                              /**< (MCAN_PSR) Fast Last Error Code (set to 111 on read) Position */
#define MCAN_PSR_FLEC_Msk                   (0x7U << MCAN_PSR_FLEC_Pos)                    /**< (MCAN_PSR) Fast Last Error Code (set to 111 on read) Mask */
#define MCAN_PSR_FLEC(value)                (MCAN_PSR_FLEC_Msk & ((value) << MCAN_PSR_FLEC_Pos))
#define MCAN_PSR_RESI_Pos                   11                                             /**< (MCAN_PSR) ESI Flag of Last Received CAN FD Message (cleared on read) Position */
#define MCAN_PSR_RESI_Msk                   (0x1U << MCAN_PSR_RESI_Pos)                    /**< (MCAN_PSR) ESI Flag of Last Received CAN FD Message (cleared on read) Mask */
#define MCAN_PSR_RESI                       MCAN_PSR_RESI_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_PSR_RESI_Msk instead */
#define MCAN_PSR_RBRS_Pos                   12                                             /**< (MCAN_PSR) BRS Flag of Last Received CAN FD Message (cleared on read) Position */
#define MCAN_PSR_RBRS_Msk                   (0x1U << MCAN_PSR_RBRS_Pos)                    /**< (MCAN_PSR) BRS Flag of Last Received CAN FD Message (cleared on read) Mask */
#define MCAN_PSR_RBRS                       MCAN_PSR_RBRS_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_PSR_RBRS_Msk instead */
#define MCAN_PSR_REDL_Pos                   13                                             /**< (MCAN_PSR) Received a CAN FD Message (cleared on read) Position */
#define MCAN_PSR_REDL_Msk                   (0x1U << MCAN_PSR_REDL_Pos)                    /**< (MCAN_PSR) Received a CAN FD Message (cleared on read) Mask */
#define MCAN_PSR_REDL                       MCAN_PSR_REDL_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_PSR_REDL_Msk instead */
#define MCAN_PSR_MASK                       (0x3FFFU)                                      /**< \deprecated (MCAN_PSR) Register MASK  (Use MCAN_PSR_Msk instead)  */
#define MCAN_PSR_Msk                        (0x3FFFU)                                      /**< (MCAN_PSR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- MCAN_IR : (MCAN Offset: 0x50) (R/W 32) Interrupt Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RF0N:1;                    /**< bit:      0  Receive FIFO 0 New Message               */
    uint32_t RF0W:1;                    /**< bit:      1  Receive FIFO 0 Watermark Reached         */
    uint32_t RF0F:1;                    /**< bit:      2  Receive FIFO 0 Full                      */
    uint32_t RF0L:1;                    /**< bit:      3  Receive FIFO 0 Message Lost              */
    uint32_t RF1N:1;                    /**< bit:      4  Receive FIFO 1 New Message               */
    uint32_t RF1W:1;                    /**< bit:      5  Receive FIFO 1 Watermark Reached         */
    uint32_t RF1F:1;                    /**< bit:      6  Receive FIFO 1 Full                      */
    uint32_t RF1L:1;                    /**< bit:      7  Receive FIFO 1 Message Lost              */
    uint32_t HPM:1;                     /**< bit:      8  High Priority Message                    */
    uint32_t TC:1;                      /**< bit:      9  Transmission Completed                   */
    uint32_t TCF:1;                     /**< bit:     10  Transmission Cancellation Finished       */
    uint32_t TFE:1;                     /**< bit:     11  Tx FIFO Empty                            */
    uint32_t TEFN:1;                    /**< bit:     12  Tx Event FIFO New Entry                  */
    uint32_t TEFW:1;                    /**< bit:     13  Tx Event FIFO Watermark Reached          */
    uint32_t TEFF:1;                    /**< bit:     14  Tx Event FIFO Full                       */
    uint32_t TEFL:1;                    /**< bit:     15  Tx Event FIFO Element Lost               */
    uint32_t TSW:1;                     /**< bit:     16  Timestamp Wraparound                     */
    uint32_t MRAF:1;                    /**< bit:     17  Message RAM Access Failure               */
    uint32_t TOO:1;                     /**< bit:     18  Timeout Occurred                         */
    uint32_t DRX:1;                     /**< bit:     19  Message stored to Dedicated Receive Buffer */
    uint32_t :2;                        /**< bit: 20..21  Reserved */
    uint32_t ELO:1;                     /**< bit:     22  Error Logging Overflow                   */
    uint32_t EP:1;                      /**< bit:     23  Error Passive                            */
    uint32_t EW:1;                      /**< bit:     24  Warning Status                           */
    uint32_t BO:1;                      /**< bit:     25  Bus_Off Status                           */
    uint32_t WDI:1;                     /**< bit:     26  Watchdog Interrupt                       */
    uint32_t CRCE:1;                    /**< bit:     27  CRC Error                                */
    uint32_t BE:1;                      /**< bit:     28  Bit Error                                */
    uint32_t ACKE:1;                    /**< bit:     29  Acknowledge Error                        */
    uint32_t FOE:1;                     /**< bit:     30  Format Error                             */
    uint32_t STE:1;                     /**< bit:     31  Stuff Error                              */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_IR_Type;
