aehoppe/E70N19_Dev_Board/atsame70n19/include/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_IE_OFFSET                      (0x54)                                        /**<  (MCAN_IE) Interrupt Enable Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define MCAN_IE_RF0NE_Pos                   0                                              /**< (MCAN_IE) Receive FIFO 0 New Message Interrupt Enable Position */
#define MCAN_IE_RF0NE_Msk                   (0x1U << MCAN_IE_RF0NE_Pos)                    /**< (MCAN_IE) Receive FIFO 0 New Message Interrupt Enable Mask */
#define MCAN_IE_RF0NE                       MCAN_IE_RF0NE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_RF0NE_Msk instead */
#define MCAN_IE_RF0WE_Pos                   1                                              /**< (MCAN_IE) Receive FIFO 0 Watermark Reached Interrupt Enable Position */
#define MCAN_IE_RF0WE_Msk                   (0x1U << MCAN_IE_RF0WE_Pos)                    /**< (MCAN_IE) Receive FIFO 0 Watermark Reached Interrupt Enable Mask */
#define MCAN_IE_RF0WE                       MCAN_IE_RF0WE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_RF0WE_Msk instead */
#define MCAN_IE_RF0FE_Pos                   2                                              /**< (MCAN_IE) Receive FIFO 0 Full Interrupt Enable Position */
#define MCAN_IE_RF0FE_Msk                   (0x1U << MCAN_IE_RF0FE_Pos)                    /**< (MCAN_IE) Receive FIFO 0 Full Interrupt Enable Mask */
#define MCAN_IE_RF0FE                       MCAN_IE_RF0FE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_RF0FE_Msk instead */
#define MCAN_IE_RF0LE_Pos                   3                                              /**< (MCAN_IE) Receive FIFO 0 Message Lost Interrupt Enable Position */
#define MCAN_IE_RF0LE_Msk                   (0x1U << MCAN_IE_RF0LE_Pos)                    /**< (MCAN_IE) Receive FIFO 0 Message Lost Interrupt Enable Mask */
#define MCAN_IE_RF0LE                       MCAN_IE_RF0LE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_RF0LE_Msk instead */
#define MCAN_IE_RF1NE_Pos                   4                                              /**< (MCAN_IE) Receive FIFO 1 New Message Interrupt Enable Position */
#define MCAN_IE_RF1NE_Msk                   (0x1U << MCAN_IE_RF1NE_Pos)                    /**< (MCAN_IE) Receive FIFO 1 New Message Interrupt Enable Mask */
#define MCAN_IE_RF1NE                       MCAN_IE_RF1NE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_RF1NE_Msk instead */
#define MCAN_IE_RF1WE_Pos                   5                                              /**< (MCAN_IE) Receive FIFO 1 Watermark Reached Interrupt Enable Position */
#define MCAN_IE_RF1WE_Msk                   (0x1U << MCAN_IE_RF1WE_Pos)                    /**< (MCAN_IE) Receive FIFO 1 Watermark Reached Interrupt Enable Mask */
#define MCAN_IE_RF1WE                       MCAN_IE_RF1WE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_RF1WE_Msk instead */
#define MCAN_IE_RF1FE_Pos                   6                                              /**< (MCAN_IE) Receive FIFO 1 Full Interrupt Enable Position */
#define MCAN_IE_RF1FE_Msk                   (0x1U << MCAN_IE_RF1FE_Pos)                    /**< (MCAN_IE) Receive FIFO 1 Full Interrupt Enable Mask */
#define MCAN_IE_RF1FE                       MCAN_IE_RF1FE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_RF1FE_Msk instead */
#define MCAN_IE_RF1LE_Pos                   7                                              /**< (MCAN_IE) Receive FIFO 1 Message Lost Interrupt Enable Position */
#define MCAN_IE_RF1LE_Msk                   (0x1U << MCAN_IE_RF1LE_Pos)                    /**< (MCAN_IE) Receive FIFO 1 Message Lost Interrupt Enable Mask */
#define MCAN_IE_RF1LE                       MCAN_IE_RF1LE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_RF1LE_Msk instead */
#define MCAN_IE_HPME_Pos                    8                                              /**< (MCAN_IE) High Priority Message Interrupt Enable Position */
#define MCAN_IE_HPME_Msk                    (0x1U << MCAN_IE_HPME_Pos)                     /**< (MCAN_IE) High Priority Message Interrupt Enable Mask */
#define MCAN_IE_HPME                        MCAN_IE_HPME_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_HPME_Msk instead */
#define MCAN_IE_TCE_Pos                     9                                              /**< (MCAN_IE) Transmission Completed Interrupt Enable Position */
#define MCAN_IE_TCE_Msk                     (0x1U << MCAN_IE_TCE_Pos)                      /**< (MCAN_IE) Transmission Completed Interrupt Enable Mask */
#define MCAN_IE_TCE                         MCAN_IE_TCE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_TCE_Msk instead */
#define MCAN_IE_TCFE_Pos                    10                                             /**< (MCAN_IE) Transmission Cancellation Finished Interrupt Enable Position */
#define MCAN_IE_TCFE_Msk                    (0x1U << MCAN_IE_TCFE_Pos)                     /**< (MCAN_IE) Transmission Cancellation Finished Interrupt Enable Mask */
#define MCAN_IE_TCFE                        MCAN_IE_TCFE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_TCFE_Msk instead */
#define MCAN_IE_TFEE_Pos                    11                                             /**< (MCAN_IE) Tx FIFO Empty Interrupt Enable Position */
#define MCAN_IE_TFEE_Msk                    (0x1U << MCAN_IE_TFEE_Pos)                     /**< (MCAN_IE) Tx FIFO Empty Interrupt Enable Mask */
#define MCAN_IE_TFEE                        MCAN_IE_TFEE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_TFEE_Msk instead */
#define MCAN_IE_TEFNE_Pos                   12                                             /**< (MCAN_IE) Tx Event FIFO New Entry Interrupt Enable Position */
#define MCAN_IE_TEFNE_Msk                   (0x1U << MCAN_IE_TEFNE_Pos)                    /**< (MCAN_IE) Tx Event FIFO New Entry Interrupt Enable Mask */
#define MCAN_IE_TEFNE                       MCAN_IE_TEFNE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_TEFNE_Msk instead */
#define MCAN_IE_TEFWE_Pos                   13                                             /**< (MCAN_IE) Tx Event FIFO Watermark Reached Interrupt Enable Position */
#define MCAN_IE_TEFWE_Msk                   (0x1U << MCAN_IE_TEFWE_Pos)                    /**< (MCAN_IE) Tx Event FIFO Watermark Reached Interrupt Enable Mask */
#define MCAN_IE_TEFWE                       MCAN_IE_TEFWE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_TEFWE_Msk instead */
#define MCAN_IE_TEFFE_Pos                   14                                             /**< (MCAN_IE) Tx Event FIFO Full Interrupt Enable Position */
#define MCAN_IE_TEFFE_Msk                   (0x1U << MCAN_IE_TEFFE_Pos)                    /**< (MCAN_IE) Tx Event FIFO Full Interrupt Enable Mask */
#define MCAN_IE_TEFFE                       MCAN_IE_TEFFE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_TEFFE_Msk instead */
#define MCAN_IE_TEFLE_Pos                   15                                             /**< (MCAN_IE) Tx Event FIFO Event Lost Interrupt Enable Position */
#define MCAN_IE_TEFLE_Msk                   (0x1U << MCAN_IE_TEFLE_Pos)                    /**< (MCAN_IE) Tx Event FIFO Event Lost Interrupt Enable Mask */
#define MCAN_IE_TEFLE                       MCAN_IE_TEFLE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_TEFLE_Msk instead */
#define MCAN_IE_TSWE_Pos                    16                                             /**< (MCAN_IE) Timestamp Wraparound Interrupt Enable Position */
#define MCAN_IE_TSWE_Msk                    (0x1U << MCAN_IE_TSWE_Pos)                     /**< (MCAN_IE) Timestamp Wraparound Interrupt Enable Mask */
#define MCAN_IE_TSWE                        MCAN_IE_TSWE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_TSWE_Msk instead */
#define MCAN_IE_MRAFE_Pos                   17                                             /**< (MCAN_IE) Message RAM Access Failure Interrupt Enable Position */
#define MCAN_IE_MRAFE_Msk                   (0x1U << MCAN_IE_MRAFE_Pos)                    /**< (MCAN_IE) Message RAM Access Failure Interrupt Enable Mask */
#define MCAN_IE_MRAFE                       MCAN_IE_MRAFE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_MRAFE_Msk instead */
#define MCAN_IE_TOOE_Pos                    18                                             /**< (MCAN_IE) Timeout Occurred Interrupt Enable Position */
#define MCAN_IE_TOOE_Msk                    (0x1U << MCAN_IE_TOOE_Pos)                     /**< (MCAN_IE) Timeout Occurred Interrupt Enable Mask */
#define MCAN_IE_TOOE                        MCAN_IE_TOOE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_TOOE_Msk instead */
#define MCAN_IE_DRXE_Pos                    19                                             /**< (MCAN_IE) Message stored to Dedicated Receive Buffer Interrupt Enable Position */
#define MCAN_IE_DRXE_Msk                    (0x1U << MCAN_IE_DRXE_Pos)                     /**< (MCAN_IE) Message stored to Dedicated Receive Buffer Interrupt Enable Mask */
#define MCAN_IE_DRXE                        MCAN_IE_DRXE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_DRXE_Msk instead */
#define MCAN_IE_ELOE_Pos                    22                                             /**< (MCAN_IE) Error Logging Overflow Interrupt Enable Position */
#define MCAN_IE_ELOE_Msk                    (0x1U << MCAN_IE_ELOE_Pos)                     /**< (MCAN_IE) Error Logging Overflow Interrupt Enable Mask */
#define MCAN_IE_ELOE                        MCAN_IE_ELOE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_ELOE_Msk instead */
#define MCAN_IE_EPE_Pos                     23                                             /**< (MCAN_IE) Error Passive Interrupt Enable Position */
#define MCAN_IE_EPE_Msk                     (0x1U << MCAN_IE_EPE_Pos)                      /**< (MCAN_IE) Error Passive Interrupt Enable Mask */
#define MCAN_IE_EPE                         MCAN_IE_EPE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_EPE_Msk instead */
#define MCAN_IE_EWE_Pos                     24                                             /**< (MCAN_IE) Warning Status Interrupt Enable Position */
#define MCAN_IE_EWE_Msk                     (0x1U << MCAN_IE_EWE_Pos)                      /**< (MCAN_IE) Warning Status Interrupt Enable Mask */
#define MCAN_IE_EWE                         MCAN_IE_EWE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_EWE_Msk instead */
#define MCAN_IE_BOE_Pos                     25                                             /**< (MCAN_IE) Bus_Off Status Interrupt Enable Position */
#define MCAN_IE_BOE_Msk                     (0x1U << MCAN_IE_BOE_Pos)                      /**< (MCAN_IE) Bus_Off Status Interrupt Enable Mask */
#define MCAN_IE_BOE                         MCAN_IE_BOE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_BOE_Msk instead */
#define MCAN_IE_WDIE_Pos                    26                                             /**< (MCAN_IE) Watchdog Interrupt Enable Position */
#define MCAN_IE_WDIE_Msk                    (0x1U << MCAN_IE_WDIE_Pos)                     /**< (MCAN_IE) Watchdog Interrupt Enable Mask */
#define MCAN_IE_WDIE                        MCAN_IE_WDIE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_WDIE_Msk instead */
#define MCAN_IE_CRCEE_Pos                   27                                             /**< (MCAN_IE) CRC Error Interrupt Enable Position */
#define MCAN_IE_CRCEE_Msk                   (0x1U << MCAN_IE_CRCEE_Pos)                    /**< (MCAN_IE) CRC Error Interrupt Enable Mask */
#define MCAN_IE_CRCEE                       MCAN_IE_CRCEE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_CRCEE_Msk instead */
#define MCAN_IE_BEE_Pos                     28                                             /**< (MCAN_IE) Bit Error Interrupt Enable Position */
#define MCAN_IE_BEE_Msk                     (0x1U << MCAN_IE_BEE_Pos)                      /**< (MCAN_IE) Bit Error Interrupt Enable Mask */
#define MCAN_IE_BEE                         MCAN_IE_BEE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_BEE_Msk instead */
#define MCAN_IE_ACKEE_Pos                   29                                             /**< (MCAN_IE) Acknowledge Error Interrupt Enable Position */
#define MCAN_IE_ACKEE_Msk                   (0x1U << MCAN_IE_ACKEE_Pos)                    /**< (MCAN_IE) Acknowledge Error Interrupt Enable Mask */
#define MCAN_IE_ACKEE                       MCAN_IE_ACKEE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_ACKEE_Msk instead */
#define MCAN_IE_FOEE_Pos                    30                                             /**< (MCAN_IE) Format Error Interrupt Enable Position */
#define MCAN_IE_FOEE_Msk                    (0x1U << MCAN_IE_FOEE_Pos)                     /**< (MCAN_IE) Format Error Interrupt Enable Mask */
#define MCAN_IE_FOEE                        MCAN_IE_FOEE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_FOEE_Msk instead */
#define MCAN_IE_STEE_Pos                    31                                             /**< (MCAN_IE) Stuff Error Interrupt Enable Position */
#define MCAN_IE_STEE_Msk                    (0x1U << MCAN_IE_STEE_Pos)                     /**< (MCAN_IE) Stuff Error Interrupt Enable Mask */
#define MCAN_IE_STEE                        MCAN_IE_STEE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IE_STEE_Msk instead */
#define MCAN_IE_MASK                        (0xFFCFFFFFU)                                  /**< \deprecated (MCAN_IE) Register MASK  (Use MCAN_IE_Msk instead)  */
#define MCAN_IE_Msk                         (0xFFCFFFFFU)                                  /**< (MCAN_IE) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- MCAN_ILS : (MCAN Offset: 0x58) (R/W 32) Interrupt Line Select Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RF0NL:1;                   /**< bit:      0  Receive FIFO 0 New Message Interrupt Line */
    uint32_t RF0WL:1;                   /**< bit:      1  Receive FIFO 0 Watermark Reached Interrupt Line */
    uint32_t RF0FL:1;                   /**< bit:      2  Receive FIFO 0 Full Interrupt Line       */
    uint32_t RF0LL:1;                   /**< bit:      3  Receive FIFO 0 Message Lost Interrupt Line */
    uint32_t RF1NL:1;                   /**< bit:      4  Receive FIFO 1 New Message Interrupt Line */
    uint32_t RF1WL:1;                   /**< bit:      5  Receive FIFO 1 Watermark Reached Interrupt Line */
    uint32_t RF1FL:1;                   /**< bit:      6  Receive FIFO 1 Full Interrupt Line       */
    uint32_t RF1LL:1;                   /**< bit:      7  Receive FIFO 1 Message Lost Interrupt Line */
    uint32_t HPML:1;                    /**< bit:      8  High Priority Message Interrupt Line     */
    uint32_t TCL:1;                     /**< bit:      9  Transmission Completed Interrupt Line    */
    uint32_t TCFL:1;                    /**< bit:     10  Transmission Cancellation Finished Interrupt Line */
    uint32_t TFEL:1;                    /**< bit:     11  Tx FIFO Empty Interrupt Line             */
    uint32_t TEFNL:1;                   /**< bit:     12  Tx Event FIFO New Entry Interrupt Line   */
    uint32_t TEFWL:1;                   /**< bit:     13  Tx Event FIFO Watermark Reached Interrupt Line */
    uint32_t TEFFL:1;                   /**< bit:     14  Tx Event FIFO Full Interrupt Line        */
    uint32_t TEFLL:1;                   /**< bit:     15  Tx Event FIFO Event Lost Interrupt Line  */
    uint32_t TSWL:1;                    /**< bit:     16  Timestamp Wraparound Interrupt Line      */
    uint32_t MRAFL:1;                   /**< bit:     17  Message RAM Access Failure Interrupt Line */
    uint32_t TOOL:1;                    /**< bit:     18  Timeout Occurred Interrupt Line          */
    uint32_t DRXL:1;                    /**< bit:     19  Message stored to Dedicated Receive Buffer Interrupt Line */
    uint32_t :2;                        /**< bit: 20..21  Reserved */
    uint32_t ELOL:1;                    /**< bit:     22  Error Logging Overflow Interrupt Line    */
    uint32_t EPL:1;                     /**< bit:     23  Error Passive Interrupt Line             */
    uint32_t EWL:1;                     /**< bit:     24  Warning Status Interrupt Line            */
    uint32_t BOL:1;                     /**< bit:     25  Bus_Off Status Interrupt Line            */
    uint32_t WDIL:1;                    /**< bit:     26  Watchdog Interrupt Line                  */
    uint32_t CRCEL:1;                   /**< bit:     27  CRC Error Interrupt Line                 */
    uint32_t BEL:1;                     /**< bit:     28  Bit Error Interrupt Line                 */
    uint32_t ACKEL:1;                   /**< bit:     29  Acknowledge Error Interrupt Line         */
    uint32_t FOEL:1;                    /**< bit:     30  Format Error Interrupt Line              */
    uint32_t STEL:1;                    /**< bit:     31  Stuff Error Interrupt Line               */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_ILS_Type;
