aehoppe/E70N19_Dev_Board/atsame70n19/include/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_HPMS_OFFSET                    (0x94)                                        /**<  (MCAN_HPMS) High Priority Message Status Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define MCAN_HPMS_BIDX_Pos                  0                                              /**< (MCAN_HPMS) Buffer Index Position */
#define MCAN_HPMS_BIDX_Msk                  (0x3FU << MCAN_HPMS_BIDX_Pos)                  /**< (MCAN_HPMS) Buffer Index Mask */
#define MCAN_HPMS_BIDX(value)               (MCAN_HPMS_BIDX_Msk & ((value) << MCAN_HPMS_BIDX_Pos))
#define MCAN_HPMS_MSI_Pos                   6                                              /**< (MCAN_HPMS) Message Storage Indicator Position */
#define MCAN_HPMS_MSI_Msk                   (0x3U << MCAN_HPMS_MSI_Pos)                    /**< (MCAN_HPMS) Message Storage Indicator Mask */
#define MCAN_HPMS_MSI(value)                (MCAN_HPMS_MSI_Msk & ((value) << MCAN_HPMS_MSI_Pos))
#define   MCAN_HPMS_MSI_NO_FIFO_SEL_Val     (0x0U)                                         /**< (MCAN_HPMS) No FIFO selected.  */
#define   MCAN_HPMS_MSI_LOST_Val            (0x1U)                                         /**< (MCAN_HPMS) FIFO message.  */
#define   MCAN_HPMS_MSI_FIFO_0_Val          (0x2U)                                         /**< (MCAN_HPMS) Message stored in FIFO 0.  */
#define   MCAN_HPMS_MSI_FIFO_1_Val          (0x3U)                                         /**< (MCAN_HPMS) Message stored in FIFO 1.  */
#define MCAN_HPMS_MSI_NO_FIFO_SEL           (MCAN_HPMS_MSI_NO_FIFO_SEL_Val << MCAN_HPMS_MSI_Pos)  /**< (MCAN_HPMS) No FIFO selected. Position  */
#define MCAN_HPMS_MSI_LOST                  (MCAN_HPMS_MSI_LOST_Val << MCAN_HPMS_MSI_Pos)  /**< (MCAN_HPMS) FIFO message. Position  */
#define MCAN_HPMS_MSI_FIFO_0                (MCAN_HPMS_MSI_FIFO_0_Val << MCAN_HPMS_MSI_Pos)  /**< (MCAN_HPMS) Message stored in FIFO 0. Position  */
#define MCAN_HPMS_MSI_FIFO_1                (MCAN_HPMS_MSI_FIFO_1_Val << MCAN_HPMS_MSI_Pos)  /**< (MCAN_HPMS) Message stored in FIFO 1. Position  */
#define MCAN_HPMS_FIDX_Pos                  8                                              /**< (MCAN_HPMS) Filter Index Position */
#define MCAN_HPMS_FIDX_Msk                  (0x7FU << MCAN_HPMS_FIDX_Pos)                  /**< (MCAN_HPMS) Filter Index Mask */
#define MCAN_HPMS_FIDX(value)               (MCAN_HPMS_FIDX_Msk & ((value) << MCAN_HPMS_FIDX_Pos))
#define MCAN_HPMS_FLST_Pos                  15                                             /**< (MCAN_HPMS) Filter List Position */
#define MCAN_HPMS_FLST_Msk                  (0x1U << MCAN_HPMS_FLST_Pos)                   /**< (MCAN_HPMS) Filter List Mask */
#define MCAN_HPMS_FLST                      MCAN_HPMS_FLST_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_HPMS_FLST_Msk instead */
#define MCAN_HPMS_MASK                      (0xFFFFU)                                      /**< \deprecated (MCAN_HPMS) Register MASK  (Use MCAN_HPMS_Msk instead)  */
#define MCAN_HPMS_Msk                       (0xFFFFU)                                      /**< (MCAN_HPMS) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- MCAN_NDAT1 : (MCAN Offset: 0x98) (R/W 32) New Data 1 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ND0:1;                     /**< bit:      0  New Data                                 */
    uint32_t ND1:1;                     /**< bit:      1  New Data                                 */
    uint32_t ND2:1;                     /**< bit:      2  New Data                                 */
    uint32_t ND3:1;                     /**< bit:      3  New Data                                 */
    uint32_t ND4:1;                     /**< bit:      4  New Data                                 */
    uint32_t ND5:1;                     /**< bit:      5  New Data                                 */
    uint32_t ND6:1;                     /**< bit:      6  New Data                                 */
    uint32_t ND7:1;                     /**< bit:      7  New Data                                 */
    uint32_t ND8:1;                     /**< bit:      8  New Data                                 */
    uint32_t ND9:1;                     /**< bit:      9  New Data                                 */
    uint32_t ND10:1;                    /**< bit:     10  New Data                                 */
    uint32_t ND11:1;                    /**< bit:     11  New Data                                 */
    uint32_t ND12:1;                    /**< bit:     12  New Data                                 */
    uint32_t ND13:1;                    /**< bit:     13  New Data                                 */
    uint32_t ND14:1;                    /**< bit:     14  New Data                                 */
    uint32_t ND15:1;                    /**< bit:     15  New Data                                 */
    uint32_t ND16:1;                    /**< bit:     16  New Data                                 */
    uint32_t ND17:1;                    /**< bit:     17  New Data                                 */
    uint32_t ND18:1;                    /**< bit:     18  New Data                                 */
    uint32_t ND19:1;                    /**< bit:     19  New Data                                 */
    uint32_t ND20:1;                    /**< bit:     20  New Data                                 */
    uint32_t ND21:1;                    /**< bit:     21  New Data                                 */
    uint32_t ND22:1;                    /**< bit:     22  New Data                                 */
    uint32_t ND23:1;                    /**< bit:     23  New Data                                 */
    uint32_t ND24:1;                    /**< bit:     24  New Data                                 */
    uint32_t ND25:1;                    /**< bit:     25  New Data                                 */
    uint32_t ND26:1;                    /**< bit:     26  New Data                                 */
    uint32_t ND27:1;                    /**< bit:     27  New Data                                 */
    uint32_t ND28:1;                    /**< bit:     28  New Data                                 */
    uint32_t ND29:1;                    /**< bit:     29  New Data                                 */
    uint32_t ND30:1;                    /**< bit:     30  New Data                                 */
    uint32_t ND31:1;                    /**< bit:     31  New Data                                 */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t ND:32;                     /**< bit:  0..31  New Data                                 */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_NDAT1_Type;
