aehoppe/E70N19_Dev_Board/atsame70n19/include/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_NDAT2_OFFSET                   (0x9C)                                        /**<  (MCAN_NDAT2) New Data 2 Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define MCAN_NDAT2_ND32_Pos                 0                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND32_Msk                 (0x1U << MCAN_NDAT2_ND32_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND32                     MCAN_NDAT2_ND32_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND32_Msk instead */
#define MCAN_NDAT2_ND33_Pos                 1                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND33_Msk                 (0x1U << MCAN_NDAT2_ND33_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND33                     MCAN_NDAT2_ND33_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND33_Msk instead */
#define MCAN_NDAT2_ND34_Pos                 2                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND34_Msk                 (0x1U << MCAN_NDAT2_ND34_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND34                     MCAN_NDAT2_ND34_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND34_Msk instead */
#define MCAN_NDAT2_ND35_Pos                 3                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND35_Msk                 (0x1U << MCAN_NDAT2_ND35_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND35                     MCAN_NDAT2_ND35_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND35_Msk instead */
#define MCAN_NDAT2_ND36_Pos                 4                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND36_Msk                 (0x1U << MCAN_NDAT2_ND36_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND36                     MCAN_NDAT2_ND36_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND36_Msk instead */
#define MCAN_NDAT2_ND37_Pos                 5                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND37_Msk                 (0x1U << MCAN_NDAT2_ND37_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND37                     MCAN_NDAT2_ND37_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND37_Msk instead */
#define MCAN_NDAT2_ND38_Pos                 6                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND38_Msk                 (0x1U << MCAN_NDAT2_ND38_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND38                     MCAN_NDAT2_ND38_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND38_Msk instead */
#define MCAN_NDAT2_ND39_Pos                 7                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND39_Msk                 (0x1U << MCAN_NDAT2_ND39_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND39                     MCAN_NDAT2_ND39_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND39_Msk instead */
#define MCAN_NDAT2_ND40_Pos                 8                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND40_Msk                 (0x1U << MCAN_NDAT2_ND40_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND40                     MCAN_NDAT2_ND40_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND40_Msk instead */
#define MCAN_NDAT2_ND41_Pos                 9                                              /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND41_Msk                 (0x1U << MCAN_NDAT2_ND41_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND41                     MCAN_NDAT2_ND41_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND41_Msk instead */
#define MCAN_NDAT2_ND42_Pos                 10                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND42_Msk                 (0x1U << MCAN_NDAT2_ND42_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND42                     MCAN_NDAT2_ND42_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND42_Msk instead */
#define MCAN_NDAT2_ND43_Pos                 11                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND43_Msk                 (0x1U << MCAN_NDAT2_ND43_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND43                     MCAN_NDAT2_ND43_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND43_Msk instead */
#define MCAN_NDAT2_ND44_Pos                 12                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND44_Msk                 (0x1U << MCAN_NDAT2_ND44_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND44                     MCAN_NDAT2_ND44_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND44_Msk instead */
#define MCAN_NDAT2_ND45_Pos                 13                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND45_Msk                 (0x1U << MCAN_NDAT2_ND45_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND45                     MCAN_NDAT2_ND45_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND45_Msk instead */
#define MCAN_NDAT2_ND46_Pos                 14                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND46_Msk                 (0x1U << MCAN_NDAT2_ND46_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND46                     MCAN_NDAT2_ND46_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND46_Msk instead */
#define MCAN_NDAT2_ND47_Pos                 15                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND47_Msk                 (0x1U << MCAN_NDAT2_ND47_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND47                     MCAN_NDAT2_ND47_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND47_Msk instead */
#define MCAN_NDAT2_ND48_Pos                 16                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND48_Msk                 (0x1U << MCAN_NDAT2_ND48_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND48                     MCAN_NDAT2_ND48_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND48_Msk instead */
#define MCAN_NDAT2_ND49_Pos                 17                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND49_Msk                 (0x1U << MCAN_NDAT2_ND49_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND49                     MCAN_NDAT2_ND49_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND49_Msk instead */
#define MCAN_NDAT2_ND50_Pos                 18                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND50_Msk                 (0x1U << MCAN_NDAT2_ND50_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND50                     MCAN_NDAT2_ND50_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND50_Msk instead */
#define MCAN_NDAT2_ND51_Pos                 19                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND51_Msk                 (0x1U << MCAN_NDAT2_ND51_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND51                     MCAN_NDAT2_ND51_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND51_Msk instead */
#define MCAN_NDAT2_ND52_Pos                 20                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND52_Msk                 (0x1U << MCAN_NDAT2_ND52_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND52                     MCAN_NDAT2_ND52_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND52_Msk instead */
#define MCAN_NDAT2_ND53_Pos                 21                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND53_Msk                 (0x1U << MCAN_NDAT2_ND53_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND53                     MCAN_NDAT2_ND53_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND53_Msk instead */
#define MCAN_NDAT2_ND54_Pos                 22                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND54_Msk                 (0x1U << MCAN_NDAT2_ND54_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND54                     MCAN_NDAT2_ND54_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND54_Msk instead */
#define MCAN_NDAT2_ND55_Pos                 23                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND55_Msk                 (0x1U << MCAN_NDAT2_ND55_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND55                     MCAN_NDAT2_ND55_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND55_Msk instead */
#define MCAN_NDAT2_ND56_Pos                 24                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND56_Msk                 (0x1U << MCAN_NDAT2_ND56_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND56                     MCAN_NDAT2_ND56_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND56_Msk instead */
#define MCAN_NDAT2_ND57_Pos                 25                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND57_Msk                 (0x1U << MCAN_NDAT2_ND57_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND57                     MCAN_NDAT2_ND57_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND57_Msk instead */
#define MCAN_NDAT2_ND58_Pos                 26                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND58_Msk                 (0x1U << MCAN_NDAT2_ND58_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND58                     MCAN_NDAT2_ND58_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND58_Msk instead */
#define MCAN_NDAT2_ND59_Pos                 27                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND59_Msk                 (0x1U << MCAN_NDAT2_ND59_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND59                     MCAN_NDAT2_ND59_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND59_Msk instead */
#define MCAN_NDAT2_ND60_Pos                 28                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND60_Msk                 (0x1U << MCAN_NDAT2_ND60_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND60                     MCAN_NDAT2_ND60_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND60_Msk instead */
#define MCAN_NDAT2_ND61_Pos                 29                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND61_Msk                 (0x1U << MCAN_NDAT2_ND61_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND61                     MCAN_NDAT2_ND61_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND61_Msk instead */
#define MCAN_NDAT2_ND62_Pos                 30                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND62_Msk                 (0x1U << MCAN_NDAT2_ND62_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND62                     MCAN_NDAT2_ND62_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND62_Msk instead */
#define MCAN_NDAT2_ND63_Pos                 31                                             /**< (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND63_Msk                 (0x1U << MCAN_NDAT2_ND63_Pos)                  /**< (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND63                     MCAN_NDAT2_ND63_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_NDAT2_ND63_Msk instead */
#define MCAN_NDAT2_ND_Pos                   0                                              /**< (MCAN_NDAT2 Position) New Data */
#define MCAN_NDAT2_ND_Msk                   (0xFFFFFFFFU << MCAN_NDAT2_ND_Pos)             /**< (MCAN_NDAT2 Mask) ND */
#define MCAN_NDAT2_ND(value)                (MCAN_NDAT2_ND_Msk & ((value) << MCAN_NDAT2_ND_Pos))  
#define MCAN_NDAT2_MASK                     (0xFFFFFFFFU)                                  /**< \deprecated (MCAN_NDAT2) Register MASK  (Use MCAN_NDAT2_Msk instead)  */
#define MCAN_NDAT2_Msk                      (0xFFFFFFFFU)                                  /**< (MCAN_NDAT2) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


