aehoppe/E70N19_Dev_Board/atsame70n19/include/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TXESC_OFFSET                   (0xC8)                                        /**<  (MCAN_TXESC) Transmit Buffer Element Size Configuration Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define MCAN_TXESC_TBDS_Pos                 0                                              /**< (MCAN_TXESC) Tx Buffer Data Field Size Position */
#define MCAN_TXESC_TBDS_Msk                 (0x7U << MCAN_TXESC_TBDS_Pos)                  /**< (MCAN_TXESC) Tx Buffer Data Field Size Mask */
#define MCAN_TXESC_TBDS(value)              (MCAN_TXESC_TBDS_Msk & ((value) << MCAN_TXESC_TBDS_Pos))
#define   MCAN_TXESC_TBDS_8_BYTE_Val        (0x0U)                                         /**< (MCAN_TXESC) 8-byte data field  */
#define   MCAN_TXESC_TBDS_12_BYTE_Val       (0x1U)                                         /**< (MCAN_TXESC) 12-byte data field  */
#define   MCAN_TXESC_TBDS_16_BYTE_Val       (0x2U)                                         /**< (MCAN_TXESC) 16-byte data field  */
#define   MCAN_TXESC_TBDS_20_BYTE_Val       (0x3U)                                         /**< (MCAN_TXESC) 20-byte data field  */
#define   MCAN_TXESC_TBDS_24_BYTE_Val       (0x4U)                                         /**< (MCAN_TXESC) 24-byte data field  */
#define   MCAN_TXESC_TBDS_32_BYTE_Val       (0x5U)                                         /**< (MCAN_TXESC) 32-byte data field  */
#define   MCAN_TXESC_TBDS_48_BYTE_Val       (0x6U)                                         /**< (MCAN_TXESC) 4- byte data field  */
#define   MCAN_TXESC_TBDS_64_BYTE_Val       (0x7U)                                         /**< (MCAN_TXESC) 64-byte data field  */
#define MCAN_TXESC_TBDS_8_BYTE              (MCAN_TXESC_TBDS_8_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 8-byte data field Position  */
#define MCAN_TXESC_TBDS_12_BYTE             (MCAN_TXESC_TBDS_12_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 12-byte data field Position  */
#define MCAN_TXESC_TBDS_16_BYTE             (MCAN_TXESC_TBDS_16_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 16-byte data field Position  */
#define MCAN_TXESC_TBDS_20_BYTE             (MCAN_TXESC_TBDS_20_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 20-byte data field Position  */
#define MCAN_TXESC_TBDS_24_BYTE             (MCAN_TXESC_TBDS_24_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 24-byte data field Position  */
#define MCAN_TXESC_TBDS_32_BYTE             (MCAN_TXESC_TBDS_32_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 32-byte data field Position  */
#define MCAN_TXESC_TBDS_48_BYTE             (MCAN_TXESC_TBDS_48_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 4- byte data field Position  */
#define MCAN_TXESC_TBDS_64_BYTE             (MCAN_TXESC_TBDS_64_BYTE_Val << MCAN_TXESC_TBDS_Pos)  /**< (MCAN_TXESC) 64-byte data field Position  */
#define MCAN_TXESC_MASK                     (0x07U)                                        /**< \deprecated (MCAN_TXESC) Register MASK  (Use MCAN_TXESC_Msk instead)  */
#define MCAN_TXESC_Msk                      (0x07U)                                        /**< (MCAN_TXESC) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- MCAN_TXBRP : (MCAN Offset: 0xcc) (R/ 32) Transmit Buffer Request Pending Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TRP0:1;                    /**< bit:      0  Transmission Request Pending for Buffer 0 */
    uint32_t TRP1:1;                    /**< bit:      1  Transmission Request Pending for Buffer 1 */
    uint32_t TRP2:1;                    /**< bit:      2  Transmission Request Pending for Buffer 2 */
    uint32_t TRP3:1;                    /**< bit:      3  Transmission Request Pending for Buffer 3 */
    uint32_t TRP4:1;                    /**< bit:      4  Transmission Request Pending for Buffer 4 */
    uint32_t TRP5:1;                    /**< bit:      5  Transmission Request Pending for Buffer 5 */
    uint32_t TRP6:1;                    /**< bit:      6  Transmission Request Pending for Buffer 6 */
    uint32_t TRP7:1;                    /**< bit:      7  Transmission Request Pending for Buffer 7 */
    uint32_t TRP8:1;                    /**< bit:      8  Transmission Request Pending for Buffer 8 */
    uint32_t TRP9:1;                    /**< bit:      9  Transmission Request Pending for Buffer 9 */
    uint32_t TRP10:1;                   /**< bit:     10  Transmission Request Pending for Buffer 10 */
    uint32_t TRP11:1;                   /**< bit:     11  Transmission Request Pending for Buffer 11 */
    uint32_t TRP12:1;                   /**< bit:     12  Transmission Request Pending for Buffer 12 */
    uint32_t TRP13:1;                   /**< bit:     13  Transmission Request Pending for Buffer 13 */
    uint32_t TRP14:1;                   /**< bit:     14  Transmission Request Pending for Buffer 14 */
    uint32_t TRP15:1;                   /**< bit:     15  Transmission Request Pending for Buffer 15 */
    uint32_t TRP16:1;                   /**< bit:     16  Transmission Request Pending for Buffer 16 */
    uint32_t TRP17:1;                   /**< bit:     17  Transmission Request Pending for Buffer 17 */
    uint32_t TRP18:1;                   /**< bit:     18  Transmission Request Pending for Buffer 18 */
    uint32_t TRP19:1;                   /**< bit:     19  Transmission Request Pending for Buffer 19 */
    uint32_t TRP20:1;                   /**< bit:     20  Transmission Request Pending for Buffer 20 */
    uint32_t TRP21:1;                   /**< bit:     21  Transmission Request Pending for Buffer 21 */
    uint32_t TRP22:1;                   /**< bit:     22  Transmission Request Pending for Buffer 22 */
    uint32_t TRP23:1;                   /**< bit:     23  Transmission Request Pending for Buffer 23 */
    uint32_t TRP24:1;                   /**< bit:     24  Transmission Request Pending for Buffer 24 */
    uint32_t TRP25:1;                   /**< bit:     25  Transmission Request Pending for Buffer 25 */
    uint32_t TRP26:1;                   /**< bit:     26  Transmission Request Pending for Buffer 26 */
    uint32_t TRP27:1;                   /**< bit:     27  Transmission Request Pending for Buffer 27 */
    uint32_t TRP28:1;                   /**< bit:     28  Transmission Request Pending for Buffer 28 */
    uint32_t TRP29:1;                   /**< bit:     29  Transmission Request Pending for Buffer 29 */
    uint32_t TRP30:1;                   /**< bit:     30  Transmission Request Pending for Buffer 30 */
    uint32_t TRP31:1;                   /**< bit:     31  Transmission Request Pending for Buffer 31 */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t TRP:32;                    /**< bit:  0..31  Transmission Request Pending for Buffer 3x */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_TXBRP_Type;
