aehoppe/E70N19_Dev_Board/atsame70n19/include/component/mcan.h
/* -------- MCAN_TXBCR : (MCAN Offset: 0xd4) (R/W 32) Transmit Buffer Cancellation Request Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CR0:1;                     /**< bit:      0  Cancellation Request for Transmit Buffer 0 */
    uint32_t CR1:1;                     /**< bit:      1  Cancellation Request for Transmit Buffer 1 */
    uint32_t CR2:1;                     /**< bit:      2  Cancellation Request for Transmit Buffer 2 */
    uint32_t CR3:1;                     /**< bit:      3  Cancellation Request for Transmit Buffer 3 */
    uint32_t CR4:1;                     /**< bit:      4  Cancellation Request for Transmit Buffer 4 */
    uint32_t CR5:1;                     /**< bit:      5  Cancellation Request for Transmit Buffer 5 */
    uint32_t CR6:1;                     /**< bit:      6  Cancellation Request for Transmit Buffer 6 */
    uint32_t CR7:1;                     /**< bit:      7  Cancellation Request for Transmit Buffer 7 */
    uint32_t CR8:1;                     /**< bit:      8  Cancellation Request for Transmit Buffer 8 */
    uint32_t CR9:1;                     /**< bit:      9  Cancellation Request for Transmit Buffer 9 */
    uint32_t CR10:1;                    /**< bit:     10  Cancellation Request for Transmit Buffer 10 */
    uint32_t CR11:1;                    /**< bit:     11  Cancellation Request for Transmit Buffer 11 */
    uint32_t CR12:1;                    /**< bit:     12  Cancellation Request for Transmit Buffer 12 */
    uint32_t CR13:1;                    /**< bit:     13  Cancellation Request for Transmit Buffer 13 */
    uint32_t CR14:1;                    /**< bit:     14  Cancellation Request for Transmit Buffer 14 */
    uint32_t CR15:1;                    /**< bit:     15  Cancellation Request for Transmit Buffer 15 */
    uint32_t CR16:1;                    /**< bit:     16  Cancellation Request for Transmit Buffer 16 */
    uint32_t CR17:1;                    /**< bit:     17  Cancellation Request for Transmit Buffer 17 */
    uint32_t CR18:1;                    /**< bit:     18  Cancellation Request for Transmit Buffer 18 */
    uint32_t CR19:1;                    /**< bit:     19  Cancellation Request for Transmit Buffer 19 */
    uint32_t CR20:1;                    /**< bit:     20  Cancellation Request for Transmit Buffer 20 */
    uint32_t CR21:1;                    /**< bit:     21  Cancellation Request for Transmit Buffer 21 */
    uint32_t CR22:1;                    /**< bit:     22  Cancellation Request for Transmit Buffer 22 */
    uint32_t CR23:1;                    /**< bit:     23  Cancellation Request for Transmit Buffer 23 */
    uint32_t CR24:1;                    /**< bit:     24  Cancellation Request for Transmit Buffer 24 */
    uint32_t CR25:1;                    /**< bit:     25  Cancellation Request for Transmit Buffer 25 */
    uint32_t CR26:1;                    /**< bit:     26  Cancellation Request for Transmit Buffer 26 */
    uint32_t CR27:1;                    /**< bit:     27  Cancellation Request for Transmit Buffer 27 */
    uint32_t CR28:1;                    /**< bit:     28  Cancellation Request for Transmit Buffer 28 */
    uint32_t CR29:1;                    /**< bit:     29  Cancellation Request for Transmit Buffer 29 */
    uint32_t CR30:1;                    /**< bit:     30  Cancellation Request for Transmit Buffer 30 */
    uint32_t CR31:1;                    /**< bit:     31  Cancellation Request for Transmit Buffer 31 */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CR:32;                     /**< bit:  0..31  Cancellation Request for Transmit Buffer 3x */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_TXBCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TXBCR_OFFSET                   (0xD4)                                        /**<  (MCAN_TXBCR) Transmit Buffer Cancellation Request Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define MCAN_TXBCR_CR0_Pos                  0                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 0 Position */
#define MCAN_TXBCR_CR0_Msk                  (0x1U << MCAN_TXBCR_CR0_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 0 Mask */
#define MCAN_TXBCR_CR0                      MCAN_TXBCR_CR0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR0_Msk instead */
#define MCAN_TXBCR_CR1_Pos                  1                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 1 Position */
#define MCAN_TXBCR_CR1_Msk                  (0x1U << MCAN_TXBCR_CR1_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 1 Mask */
#define MCAN_TXBCR_CR1                      MCAN_TXBCR_CR1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR1_Msk instead */
#define MCAN_TXBCR_CR2_Pos                  2                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 2 Position */
#define MCAN_TXBCR_CR2_Msk                  (0x1U << MCAN_TXBCR_CR2_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 2 Mask */
#define MCAN_TXBCR_CR2                      MCAN_TXBCR_CR2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR2_Msk instead */
#define MCAN_TXBCR_CR3_Pos                  3                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 3 Position */
#define MCAN_TXBCR_CR3_Msk                  (0x1U << MCAN_TXBCR_CR3_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 3 Mask */
#define MCAN_TXBCR_CR3                      MCAN_TXBCR_CR3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR3_Msk instead */
#define MCAN_TXBCR_CR4_Pos                  4                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 4 Position */
#define MCAN_TXBCR_CR4_Msk                  (0x1U << MCAN_TXBCR_CR4_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 4 Mask */
#define MCAN_TXBCR_CR4                      MCAN_TXBCR_CR4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR4_Msk instead */
#define MCAN_TXBCR_CR5_Pos                  5                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 5 Position */
#define MCAN_TXBCR_CR5_Msk                  (0x1U << MCAN_TXBCR_CR5_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 5 Mask */
#define MCAN_TXBCR_CR5                      MCAN_TXBCR_CR5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR5_Msk instead */
#define MCAN_TXBCR_CR6_Pos                  6                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 6 Position */
#define MCAN_TXBCR_CR6_Msk                  (0x1U << MCAN_TXBCR_CR6_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 6 Mask */
#define MCAN_TXBCR_CR6                      MCAN_TXBCR_CR6_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR6_Msk instead */
#define MCAN_TXBCR_CR7_Pos                  7                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 7 Position */
#define MCAN_TXBCR_CR7_Msk                  (0x1U << MCAN_TXBCR_CR7_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 7 Mask */
#define MCAN_TXBCR_CR7                      MCAN_TXBCR_CR7_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR7_Msk instead */
#define MCAN_TXBCR_CR8_Pos                  8                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 8 Position */
#define MCAN_TXBCR_CR8_Msk                  (0x1U << MCAN_TXBCR_CR8_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 8 Mask */
#define MCAN_TXBCR_CR8                      MCAN_TXBCR_CR8_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR8_Msk instead */
#define MCAN_TXBCR_CR9_Pos                  9                                              /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 9 Position */
#define MCAN_TXBCR_CR9_Msk                  (0x1U << MCAN_TXBCR_CR9_Pos)                   /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 9 Mask */
#define MCAN_TXBCR_CR9                      MCAN_TXBCR_CR9_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR9_Msk instead */
#define MCAN_TXBCR_CR10_Pos                 10                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 10 Position */
#define MCAN_TXBCR_CR10_Msk                 (0x1U << MCAN_TXBCR_CR10_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 10 Mask */
#define MCAN_TXBCR_CR10                     MCAN_TXBCR_CR10_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR10_Msk instead */
#define MCAN_TXBCR_CR11_Pos                 11                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 11 Position */
#define MCAN_TXBCR_CR11_Msk                 (0x1U << MCAN_TXBCR_CR11_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 11 Mask */
#define MCAN_TXBCR_CR11                     MCAN_TXBCR_CR11_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR11_Msk instead */
#define MCAN_TXBCR_CR12_Pos                 12                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 12 Position */
#define MCAN_TXBCR_CR12_Msk                 (0x1U << MCAN_TXBCR_CR12_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 12 Mask */
#define MCAN_TXBCR_CR12                     MCAN_TXBCR_CR12_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR12_Msk instead */
#define MCAN_TXBCR_CR13_Pos                 13                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 13 Position */
#define MCAN_TXBCR_CR13_Msk                 (0x1U << MCAN_TXBCR_CR13_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 13 Mask */
#define MCAN_TXBCR_CR13                     MCAN_TXBCR_CR13_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR13_Msk instead */
#define MCAN_TXBCR_CR14_Pos                 14                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 14 Position */
#define MCAN_TXBCR_CR14_Msk                 (0x1U << MCAN_TXBCR_CR14_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 14 Mask */
#define MCAN_TXBCR_CR14                     MCAN_TXBCR_CR14_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR14_Msk instead */
#define MCAN_TXBCR_CR15_Pos                 15                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 15 Position */
#define MCAN_TXBCR_CR15_Msk                 (0x1U << MCAN_TXBCR_CR15_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 15 Mask */
#define MCAN_TXBCR_CR15                     MCAN_TXBCR_CR15_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR15_Msk instead */
#define MCAN_TXBCR_CR16_Pos                 16                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 16 Position */
#define MCAN_TXBCR_CR16_Msk                 (0x1U << MCAN_TXBCR_CR16_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 16 Mask */
#define MCAN_TXBCR_CR16                     MCAN_TXBCR_CR16_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR16_Msk instead */
#define MCAN_TXBCR_CR17_Pos                 17                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 17 Position */
#define MCAN_TXBCR_CR17_Msk                 (0x1U << MCAN_TXBCR_CR17_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 17 Mask */
#define MCAN_TXBCR_CR17                     MCAN_TXBCR_CR17_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR17_Msk instead */
#define MCAN_TXBCR_CR18_Pos                 18                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 18 Position */
#define MCAN_TXBCR_CR18_Msk                 (0x1U << MCAN_TXBCR_CR18_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 18 Mask */
#define MCAN_TXBCR_CR18                     MCAN_TXBCR_CR18_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR18_Msk instead */
#define MCAN_TXBCR_CR19_Pos                 19                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 19 Position */
#define MCAN_TXBCR_CR19_Msk                 (0x1U << MCAN_TXBCR_CR19_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 19 Mask */
#define MCAN_TXBCR_CR19                     MCAN_TXBCR_CR19_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR19_Msk instead */
#define MCAN_TXBCR_CR20_Pos                 20                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 20 Position */
#define MCAN_TXBCR_CR20_Msk                 (0x1U << MCAN_TXBCR_CR20_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 20 Mask */
#define MCAN_TXBCR_CR20                     MCAN_TXBCR_CR20_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR20_Msk instead */
#define MCAN_TXBCR_CR21_Pos                 21                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 21 Position */
#define MCAN_TXBCR_CR21_Msk                 (0x1U << MCAN_TXBCR_CR21_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 21 Mask */
#define MCAN_TXBCR_CR21                     MCAN_TXBCR_CR21_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR21_Msk instead */
#define MCAN_TXBCR_CR22_Pos                 22                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 22 Position */
#define MCAN_TXBCR_CR22_Msk                 (0x1U << MCAN_TXBCR_CR22_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 22 Mask */
#define MCAN_TXBCR_CR22                     MCAN_TXBCR_CR22_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR22_Msk instead */
#define MCAN_TXBCR_CR23_Pos                 23                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 23 Position */
#define MCAN_TXBCR_CR23_Msk                 (0x1U << MCAN_TXBCR_CR23_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 23 Mask */
#define MCAN_TXBCR_CR23                     MCAN_TXBCR_CR23_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR23_Msk instead */
#define MCAN_TXBCR_CR24_Pos                 24                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 24 Position */
#define MCAN_TXBCR_CR24_Msk                 (0x1U << MCAN_TXBCR_CR24_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 24 Mask */
#define MCAN_TXBCR_CR24                     MCAN_TXBCR_CR24_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR24_Msk instead */
#define MCAN_TXBCR_CR25_Pos                 25                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 25 Position */
#define MCAN_TXBCR_CR25_Msk                 (0x1U << MCAN_TXBCR_CR25_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 25 Mask */
#define MCAN_TXBCR_CR25                     MCAN_TXBCR_CR25_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR25_Msk instead */
#define MCAN_TXBCR_CR26_Pos                 26                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 26 Position */
#define MCAN_TXBCR_CR26_Msk                 (0x1U << MCAN_TXBCR_CR26_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 26 Mask */
#define MCAN_TXBCR_CR26                     MCAN_TXBCR_CR26_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR26_Msk instead */
#define MCAN_TXBCR_CR27_Pos                 27                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 27 Position */
#define MCAN_TXBCR_CR27_Msk                 (0x1U << MCAN_TXBCR_CR27_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 27 Mask */
#define MCAN_TXBCR_CR27                     MCAN_TXBCR_CR27_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR27_Msk instead */
#define MCAN_TXBCR_CR28_Pos                 28                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 28 Position */
#define MCAN_TXBCR_CR28_Msk                 (0x1U << MCAN_TXBCR_CR28_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 28 Mask */
#define MCAN_TXBCR_CR28                     MCAN_TXBCR_CR28_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR28_Msk instead */
#define MCAN_TXBCR_CR29_Pos                 29                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 29 Position */
#define MCAN_TXBCR_CR29_Msk                 (0x1U << MCAN_TXBCR_CR29_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 29 Mask */
#define MCAN_TXBCR_CR29                     MCAN_TXBCR_CR29_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR29_Msk instead */
#define MCAN_TXBCR_CR30_Pos                 30                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 30 Position */
#define MCAN_TXBCR_CR30_Msk                 (0x1U << MCAN_TXBCR_CR30_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 30 Mask */
#define MCAN_TXBCR_CR30                     MCAN_TXBCR_CR30_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR30_Msk instead */
#define MCAN_TXBCR_CR31_Pos                 31                                             /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 31 Position */
#define MCAN_TXBCR_CR31_Msk                 (0x1U << MCAN_TXBCR_CR31_Pos)                  /**< (MCAN_TXBCR) Cancellation Request for Transmit Buffer 31 Mask */
#define MCAN_TXBCR_CR31                     MCAN_TXBCR_CR31_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBCR_CR31_Msk instead */
#define MCAN_TXBCR_CR_Pos                   0                                              /**< (MCAN_TXBCR Position) Cancellation Request for Transmit Buffer 3x */
#define MCAN_TXBCR_CR_Msk                   (0xFFFFFFFFU << MCAN_TXBCR_CR_Pos)             /**< (MCAN_TXBCR Mask) CR */
#define MCAN_TXBCR_CR(value)                (MCAN_TXBCR_CR_Msk & ((value) << MCAN_TXBCR_CR_Pos))  
#define MCAN_TXBCR_MASK                     (0xFFFFFFFFU)                                  /**< \deprecated (MCAN_TXBCR) Register MASK  (Use MCAN_TXBCR_Msk instead)  */
#define MCAN_TXBCR_Msk                      (0xFFFFFFFFU)                                  /**< (MCAN_TXBCR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


