aehoppe/E70N19_Dev_Board/atsame70n19/include/component/mcan.h
/* -------- MCAN_TXBTO : (MCAN Offset: 0xd8) (R/ 32) Transmit Buffer Transmission Occurred Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TO0:1;                     /**< bit:      0  Transmission Occurred for Buffer 0       */
    uint32_t TO1:1;                     /**< bit:      1  Transmission Occurred for Buffer 1       */
    uint32_t TO2:1;                     /**< bit:      2  Transmission Occurred for Buffer 2       */
    uint32_t TO3:1;                     /**< bit:      3  Transmission Occurred for Buffer 3       */
    uint32_t TO4:1;                     /**< bit:      4  Transmission Occurred for Buffer 4       */
    uint32_t TO5:1;                     /**< bit:      5  Transmission Occurred for Buffer 5       */
    uint32_t TO6:1;                     /**< bit:      6  Transmission Occurred for Buffer 6       */
    uint32_t TO7:1;                     /**< bit:      7  Transmission Occurred for Buffer 7       */
    uint32_t TO8:1;                     /**< bit:      8  Transmission Occurred for Buffer 8       */
    uint32_t TO9:1;                     /**< bit:      9  Transmission Occurred for Buffer 9       */
    uint32_t TO10:1;                    /**< bit:     10  Transmission Occurred for Buffer 10      */
    uint32_t TO11:1;                    /**< bit:     11  Transmission Occurred for Buffer 11      */
    uint32_t TO12:1;                    /**< bit:     12  Transmission Occurred for Buffer 12      */
    uint32_t TO13:1;                    /**< bit:     13  Transmission Occurred for Buffer 13      */
    uint32_t TO14:1;                    /**< bit:     14  Transmission Occurred for Buffer 14      */
    uint32_t TO15:1;                    /**< bit:     15  Transmission Occurred for Buffer 15      */
    uint32_t TO16:1;                    /**< bit:     16  Transmission Occurred for Buffer 16      */
    uint32_t TO17:1;                    /**< bit:     17  Transmission Occurred for Buffer 17      */
    uint32_t TO18:1;                    /**< bit:     18  Transmission Occurred for Buffer 18      */
    uint32_t TO19:1;                    /**< bit:     19  Transmission Occurred for Buffer 19      */
    uint32_t TO20:1;                    /**< bit:     20  Transmission Occurred for Buffer 20      */
    uint32_t TO21:1;                    /**< bit:     21  Transmission Occurred for Buffer 21      */
    uint32_t TO22:1;                    /**< bit:     22  Transmission Occurred for Buffer 22      */
    uint32_t TO23:1;                    /**< bit:     23  Transmission Occurred for Buffer 23      */
    uint32_t TO24:1;                    /**< bit:     24  Transmission Occurred for Buffer 24      */
    uint32_t TO25:1;                    /**< bit:     25  Transmission Occurred for Buffer 25      */
    uint32_t TO26:1;                    /**< bit:     26  Transmission Occurred for Buffer 26      */
    uint32_t TO27:1;                    /**< bit:     27  Transmission Occurred for Buffer 27      */
    uint32_t TO28:1;                    /**< bit:     28  Transmission Occurred for Buffer 28      */
    uint32_t TO29:1;                    /**< bit:     29  Transmission Occurred for Buffer 29      */
    uint32_t TO30:1;                    /**< bit:     30  Transmission Occurred for Buffer 30      */
    uint32_t TO31:1;                    /**< bit:     31  Transmission Occurred for Buffer 31      */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t TO:32;                     /**< bit:  0..31  Transmission Occurred for Buffer 3x      */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_TXBTO_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TXBTO_OFFSET                   (0xD8)                                        /**<  (MCAN_TXBTO) Transmit Buffer Transmission Occurred Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define MCAN_TXBTO_TO0_Pos                  0                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 0 Position */
#define MCAN_TXBTO_TO0_Msk                  (0x1U << MCAN_TXBTO_TO0_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 0 Mask */
#define MCAN_TXBTO_TO0                      MCAN_TXBTO_TO0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO0_Msk instead */
#define MCAN_TXBTO_TO1_Pos                  1                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 1 Position */
#define MCAN_TXBTO_TO1_Msk                  (0x1U << MCAN_TXBTO_TO1_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 1 Mask */
#define MCAN_TXBTO_TO1                      MCAN_TXBTO_TO1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO1_Msk instead */
#define MCAN_TXBTO_TO2_Pos                  2                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 2 Position */
#define MCAN_TXBTO_TO2_Msk                  (0x1U << MCAN_TXBTO_TO2_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 2 Mask */
#define MCAN_TXBTO_TO2                      MCAN_TXBTO_TO2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO2_Msk instead */
#define MCAN_TXBTO_TO3_Pos                  3                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 3 Position */
#define MCAN_TXBTO_TO3_Msk                  (0x1U << MCAN_TXBTO_TO3_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 3 Mask */
#define MCAN_TXBTO_TO3                      MCAN_TXBTO_TO3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO3_Msk instead */
#define MCAN_TXBTO_TO4_Pos                  4                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 4 Position */
#define MCAN_TXBTO_TO4_Msk                  (0x1U << MCAN_TXBTO_TO4_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 4 Mask */
#define MCAN_TXBTO_TO4                      MCAN_TXBTO_TO4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO4_Msk instead */
#define MCAN_TXBTO_TO5_Pos                  5                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 5 Position */
#define MCAN_TXBTO_TO5_Msk                  (0x1U << MCAN_TXBTO_TO5_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 5 Mask */
#define MCAN_TXBTO_TO5                      MCAN_TXBTO_TO5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO5_Msk instead */
#define MCAN_TXBTO_TO6_Pos                  6                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 6 Position */
#define MCAN_TXBTO_TO6_Msk                  (0x1U << MCAN_TXBTO_TO6_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 6 Mask */
#define MCAN_TXBTO_TO6                      MCAN_TXBTO_TO6_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO6_Msk instead */
#define MCAN_TXBTO_TO7_Pos                  7                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 7 Position */
#define MCAN_TXBTO_TO7_Msk                  (0x1U << MCAN_TXBTO_TO7_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 7 Mask */
#define MCAN_TXBTO_TO7                      MCAN_TXBTO_TO7_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO7_Msk instead */
#define MCAN_TXBTO_TO8_Pos                  8                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 8 Position */
#define MCAN_TXBTO_TO8_Msk                  (0x1U << MCAN_TXBTO_TO8_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 8 Mask */
#define MCAN_TXBTO_TO8                      MCAN_TXBTO_TO8_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO8_Msk instead */
#define MCAN_TXBTO_TO9_Pos                  9                                              /**< (MCAN_TXBTO) Transmission Occurred for Buffer 9 Position */
#define MCAN_TXBTO_TO9_Msk                  (0x1U << MCAN_TXBTO_TO9_Pos)                   /**< (MCAN_TXBTO) Transmission Occurred for Buffer 9 Mask */
#define MCAN_TXBTO_TO9                      MCAN_TXBTO_TO9_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO9_Msk instead */
#define MCAN_TXBTO_TO10_Pos                 10                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 10 Position */
#define MCAN_TXBTO_TO10_Msk                 (0x1U << MCAN_TXBTO_TO10_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 10 Mask */
#define MCAN_TXBTO_TO10                     MCAN_TXBTO_TO10_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO10_Msk instead */
#define MCAN_TXBTO_TO11_Pos                 11                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 11 Position */
#define MCAN_TXBTO_TO11_Msk                 (0x1U << MCAN_TXBTO_TO11_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 11 Mask */
#define MCAN_TXBTO_TO11                     MCAN_TXBTO_TO11_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO11_Msk instead */
#define MCAN_TXBTO_TO12_Pos                 12                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 12 Position */
#define MCAN_TXBTO_TO12_Msk                 (0x1U << MCAN_TXBTO_TO12_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 12 Mask */
#define MCAN_TXBTO_TO12                     MCAN_TXBTO_TO12_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO12_Msk instead */
#define MCAN_TXBTO_TO13_Pos                 13                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 13 Position */
#define MCAN_TXBTO_TO13_Msk                 (0x1U << MCAN_TXBTO_TO13_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 13 Mask */
#define MCAN_TXBTO_TO13                     MCAN_TXBTO_TO13_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO13_Msk instead */
#define MCAN_TXBTO_TO14_Pos                 14                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 14 Position */
#define MCAN_TXBTO_TO14_Msk                 (0x1U << MCAN_TXBTO_TO14_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 14 Mask */
#define MCAN_TXBTO_TO14                     MCAN_TXBTO_TO14_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO14_Msk instead */
#define MCAN_TXBTO_TO15_Pos                 15                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 15 Position */
#define MCAN_TXBTO_TO15_Msk                 (0x1U << MCAN_TXBTO_TO15_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 15 Mask */
#define MCAN_TXBTO_TO15                     MCAN_TXBTO_TO15_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO15_Msk instead */
#define MCAN_TXBTO_TO16_Pos                 16                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 16 Position */
#define MCAN_TXBTO_TO16_Msk                 (0x1U << MCAN_TXBTO_TO16_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 16 Mask */
#define MCAN_TXBTO_TO16                     MCAN_TXBTO_TO16_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO16_Msk instead */
#define MCAN_TXBTO_TO17_Pos                 17                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 17 Position */
#define MCAN_TXBTO_TO17_Msk                 (0x1U << MCAN_TXBTO_TO17_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 17 Mask */
#define MCAN_TXBTO_TO17                     MCAN_TXBTO_TO17_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO17_Msk instead */
#define MCAN_TXBTO_TO18_Pos                 18                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 18 Position */
#define MCAN_TXBTO_TO18_Msk                 (0x1U << MCAN_TXBTO_TO18_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 18 Mask */
#define MCAN_TXBTO_TO18                     MCAN_TXBTO_TO18_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO18_Msk instead */
#define MCAN_TXBTO_TO19_Pos                 19                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 19 Position */
#define MCAN_TXBTO_TO19_Msk                 (0x1U << MCAN_TXBTO_TO19_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 19 Mask */
#define MCAN_TXBTO_TO19                     MCAN_TXBTO_TO19_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO19_Msk instead */
#define MCAN_TXBTO_TO20_Pos                 20                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 20 Position */
#define MCAN_TXBTO_TO20_Msk                 (0x1U << MCAN_TXBTO_TO20_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 20 Mask */
#define MCAN_TXBTO_TO20                     MCAN_TXBTO_TO20_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO20_Msk instead */
#define MCAN_TXBTO_TO21_Pos                 21                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 21 Position */
#define MCAN_TXBTO_TO21_Msk                 (0x1U << MCAN_TXBTO_TO21_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 21 Mask */
#define MCAN_TXBTO_TO21                     MCAN_TXBTO_TO21_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO21_Msk instead */
#define MCAN_TXBTO_TO22_Pos                 22                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 22 Position */
#define MCAN_TXBTO_TO22_Msk                 (0x1U << MCAN_TXBTO_TO22_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 22 Mask */
#define MCAN_TXBTO_TO22                     MCAN_TXBTO_TO22_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO22_Msk instead */
#define MCAN_TXBTO_TO23_Pos                 23                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 23 Position */
#define MCAN_TXBTO_TO23_Msk                 (0x1U << MCAN_TXBTO_TO23_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 23 Mask */
#define MCAN_TXBTO_TO23                     MCAN_TXBTO_TO23_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO23_Msk instead */
#define MCAN_TXBTO_TO24_Pos                 24                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 24 Position */
#define MCAN_TXBTO_TO24_Msk                 (0x1U << MCAN_TXBTO_TO24_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 24 Mask */
#define MCAN_TXBTO_TO24                     MCAN_TXBTO_TO24_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO24_Msk instead */
#define MCAN_TXBTO_TO25_Pos                 25                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 25 Position */
#define MCAN_TXBTO_TO25_Msk                 (0x1U << MCAN_TXBTO_TO25_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 25 Mask */
#define MCAN_TXBTO_TO25                     MCAN_TXBTO_TO25_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO25_Msk instead */
#define MCAN_TXBTO_TO26_Pos                 26                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 26 Position */
#define MCAN_TXBTO_TO26_Msk                 (0x1U << MCAN_TXBTO_TO26_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 26 Mask */
#define MCAN_TXBTO_TO26                     MCAN_TXBTO_TO26_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO26_Msk instead */
#define MCAN_TXBTO_TO27_Pos                 27                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 27 Position */
#define MCAN_TXBTO_TO27_Msk                 (0x1U << MCAN_TXBTO_TO27_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 27 Mask */
#define MCAN_TXBTO_TO27                     MCAN_TXBTO_TO27_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO27_Msk instead */
#define MCAN_TXBTO_TO28_Pos                 28                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 28 Position */
#define MCAN_TXBTO_TO28_Msk                 (0x1U << MCAN_TXBTO_TO28_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 28 Mask */
#define MCAN_TXBTO_TO28                     MCAN_TXBTO_TO28_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO28_Msk instead */
#define MCAN_TXBTO_TO29_Pos                 29                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 29 Position */
#define MCAN_TXBTO_TO29_Msk                 (0x1U << MCAN_TXBTO_TO29_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 29 Mask */
#define MCAN_TXBTO_TO29                     MCAN_TXBTO_TO29_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO29_Msk instead */
#define MCAN_TXBTO_TO30_Pos                 30                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 30 Position */
#define MCAN_TXBTO_TO30_Msk                 (0x1U << MCAN_TXBTO_TO30_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 30 Mask */
#define MCAN_TXBTO_TO30                     MCAN_TXBTO_TO30_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO30_Msk instead */
#define MCAN_TXBTO_TO31_Pos                 31                                             /**< (MCAN_TXBTO) Transmission Occurred for Buffer 31 Position */
#define MCAN_TXBTO_TO31_Msk                 (0x1U << MCAN_TXBTO_TO31_Pos)                  /**< (MCAN_TXBTO) Transmission Occurred for Buffer 31 Mask */
#define MCAN_TXBTO_TO31                     MCAN_TXBTO_TO31_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTO_TO31_Msk instead */
#define MCAN_TXBTO_TO_Pos                   0                                              /**< (MCAN_TXBTO Position) Transmission Occurred for Buffer 3x */
#define MCAN_TXBTO_TO_Msk                   (0xFFFFFFFFU << MCAN_TXBTO_TO_Pos)             /**< (MCAN_TXBTO Mask) TO */
#define MCAN_TXBTO_TO(value)                (MCAN_TXBTO_TO_Msk & ((value) << MCAN_TXBTO_TO_Pos))  
#define MCAN_TXBTO_MASK                     (0xFFFFFFFFU)                                  /**< \deprecated (MCAN_TXBTO) Register MASK  (Use MCAN_TXBTO_Msk instead)  */
#define MCAN_TXBTO_Msk                      (0xFFFFFFFFU)                                  /**< (MCAN_TXBTO) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


