aehoppe/E70N19_Dev_Board/atsame70n19/include/component/mcan.h
/* -------- MCAN_TXBTIE : (MCAN Offset: 0xe0) (R/W 32) Transmit Buffer Transmission Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TIE0:1;                    /**< bit:      0  Transmission Interrupt Enable for Buffer 0 */
    uint32_t TIE1:1;                    /**< bit:      1  Transmission Interrupt Enable for Buffer 1 */
    uint32_t TIE2:1;                    /**< bit:      2  Transmission Interrupt Enable for Buffer 2 */
    uint32_t TIE3:1;                    /**< bit:      3  Transmission Interrupt Enable for Buffer 3 */
    uint32_t TIE4:1;                    /**< bit:      4  Transmission Interrupt Enable for Buffer 4 */
    uint32_t TIE5:1;                    /**< bit:      5  Transmission Interrupt Enable for Buffer 5 */
    uint32_t TIE6:1;                    /**< bit:      6  Transmission Interrupt Enable for Buffer 6 */
    uint32_t TIE7:1;                    /**< bit:      7  Transmission Interrupt Enable for Buffer 7 */
    uint32_t TIE8:1;                    /**< bit:      8  Transmission Interrupt Enable for Buffer 8 */
    uint32_t TIE9:1;                    /**< bit:      9  Transmission Interrupt Enable for Buffer 9 */
    uint32_t TIE10:1;                   /**< bit:     10  Transmission Interrupt Enable for Buffer 10 */
    uint32_t TIE11:1;                   /**< bit:     11  Transmission Interrupt Enable for Buffer 11 */
    uint32_t TIE12:1;                   /**< bit:     12  Transmission Interrupt Enable for Buffer 12 */
    uint32_t TIE13:1;                   /**< bit:     13  Transmission Interrupt Enable for Buffer 13 */
    uint32_t TIE14:1;                   /**< bit:     14  Transmission Interrupt Enable for Buffer 14 */
    uint32_t TIE15:1;                   /**< bit:     15  Transmission Interrupt Enable for Buffer 15 */
    uint32_t TIE16:1;                   /**< bit:     16  Transmission Interrupt Enable for Buffer 16 */
    uint32_t TIE17:1;                   /**< bit:     17  Transmission Interrupt Enable for Buffer 17 */
    uint32_t TIE18:1;                   /**< bit:     18  Transmission Interrupt Enable for Buffer 18 */
    uint32_t TIE19:1;                   /**< bit:     19  Transmission Interrupt Enable for Buffer 19 */
    uint32_t TIE20:1;                   /**< bit:     20  Transmission Interrupt Enable for Buffer 20 */
    uint32_t TIE21:1;                   /**< bit:     21  Transmission Interrupt Enable for Buffer 21 */
    uint32_t TIE22:1;                   /**< bit:     22  Transmission Interrupt Enable for Buffer 22 */
    uint32_t TIE23:1;                   /**< bit:     23  Transmission Interrupt Enable for Buffer 23 */
    uint32_t TIE24:1;                   /**< bit:     24  Transmission Interrupt Enable for Buffer 24 */
    uint32_t TIE25:1;                   /**< bit:     25  Transmission Interrupt Enable for Buffer 25 */
    uint32_t TIE26:1;                   /**< bit:     26  Transmission Interrupt Enable for Buffer 26 */
    uint32_t TIE27:1;                   /**< bit:     27  Transmission Interrupt Enable for Buffer 27 */
    uint32_t TIE28:1;                   /**< bit:     28  Transmission Interrupt Enable for Buffer 28 */
    uint32_t TIE29:1;                   /**< bit:     29  Transmission Interrupt Enable for Buffer 29 */
    uint32_t TIE30:1;                   /**< bit:     30  Transmission Interrupt Enable for Buffer 30 */
    uint32_t TIE31:1;                   /**< bit:     31  Transmission Interrupt Enable for Buffer 31 */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t TIE:32;                    /**< bit:  0..31  Transmission Interrupt Enable for Buffer 3x */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_TXBTIE_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TXBTIE_OFFSET                  (0xE0)                                        /**<  (MCAN_TXBTIE) Transmit Buffer Transmission Interrupt Enable Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define MCAN_TXBTIE_TIE0_Pos                0                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 0 Position */
#define MCAN_TXBTIE_TIE0_Msk                (0x1U << MCAN_TXBTIE_TIE0_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 0 Mask */
#define MCAN_TXBTIE_TIE0                    MCAN_TXBTIE_TIE0_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE0_Msk instead */
#define MCAN_TXBTIE_TIE1_Pos                1                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 1 Position */
#define MCAN_TXBTIE_TIE1_Msk                (0x1U << MCAN_TXBTIE_TIE1_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 1 Mask */
#define MCAN_TXBTIE_TIE1                    MCAN_TXBTIE_TIE1_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE1_Msk instead */
#define MCAN_TXBTIE_TIE2_Pos                2                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 2 Position */
#define MCAN_TXBTIE_TIE2_Msk                (0x1U << MCAN_TXBTIE_TIE2_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 2 Mask */
#define MCAN_TXBTIE_TIE2                    MCAN_TXBTIE_TIE2_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE2_Msk instead */
#define MCAN_TXBTIE_TIE3_Pos                3                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 3 Position */
#define MCAN_TXBTIE_TIE3_Msk                (0x1U << MCAN_TXBTIE_TIE3_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 3 Mask */
#define MCAN_TXBTIE_TIE3                    MCAN_TXBTIE_TIE3_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE3_Msk instead */
#define MCAN_TXBTIE_TIE4_Pos                4                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 4 Position */
#define MCAN_TXBTIE_TIE4_Msk                (0x1U << MCAN_TXBTIE_TIE4_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 4 Mask */
#define MCAN_TXBTIE_TIE4                    MCAN_TXBTIE_TIE4_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE4_Msk instead */
#define MCAN_TXBTIE_TIE5_Pos                5                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 5 Position */
#define MCAN_TXBTIE_TIE5_Msk                (0x1U << MCAN_TXBTIE_TIE5_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 5 Mask */
#define MCAN_TXBTIE_TIE5                    MCAN_TXBTIE_TIE5_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE5_Msk instead */
#define MCAN_TXBTIE_TIE6_Pos                6                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 6 Position */
#define MCAN_TXBTIE_TIE6_Msk                (0x1U << MCAN_TXBTIE_TIE6_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 6 Mask */
#define MCAN_TXBTIE_TIE6                    MCAN_TXBTIE_TIE6_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE6_Msk instead */
#define MCAN_TXBTIE_TIE7_Pos                7                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 7 Position */
#define MCAN_TXBTIE_TIE7_Msk                (0x1U << MCAN_TXBTIE_TIE7_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 7 Mask */
#define MCAN_TXBTIE_TIE7                    MCAN_TXBTIE_TIE7_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE7_Msk instead */
#define MCAN_TXBTIE_TIE8_Pos                8                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 8 Position */
#define MCAN_TXBTIE_TIE8_Msk                (0x1U << MCAN_TXBTIE_TIE8_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 8 Mask */
#define MCAN_TXBTIE_TIE8                    MCAN_TXBTIE_TIE8_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE8_Msk instead */
#define MCAN_TXBTIE_TIE9_Pos                9                                              /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 9 Position */
#define MCAN_TXBTIE_TIE9_Msk                (0x1U << MCAN_TXBTIE_TIE9_Pos)                 /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 9 Mask */
#define MCAN_TXBTIE_TIE9                    MCAN_TXBTIE_TIE9_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE9_Msk instead */
#define MCAN_TXBTIE_TIE10_Pos               10                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 10 Position */
#define MCAN_TXBTIE_TIE10_Msk               (0x1U << MCAN_TXBTIE_TIE10_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 10 Mask */
#define MCAN_TXBTIE_TIE10                   MCAN_TXBTIE_TIE10_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE10_Msk instead */
#define MCAN_TXBTIE_TIE11_Pos               11                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 11 Position */
#define MCAN_TXBTIE_TIE11_Msk               (0x1U << MCAN_TXBTIE_TIE11_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 11 Mask */
#define MCAN_TXBTIE_TIE11                   MCAN_TXBTIE_TIE11_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE11_Msk instead */
#define MCAN_TXBTIE_TIE12_Pos               12                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 12 Position */
#define MCAN_TXBTIE_TIE12_Msk               (0x1U << MCAN_TXBTIE_TIE12_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 12 Mask */
#define MCAN_TXBTIE_TIE12                   MCAN_TXBTIE_TIE12_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE12_Msk instead */
#define MCAN_TXBTIE_TIE13_Pos               13                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 13 Position */
#define MCAN_TXBTIE_TIE13_Msk               (0x1U << MCAN_TXBTIE_TIE13_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 13 Mask */
#define MCAN_TXBTIE_TIE13                   MCAN_TXBTIE_TIE13_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE13_Msk instead */
#define MCAN_TXBTIE_TIE14_Pos               14                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 14 Position */
#define MCAN_TXBTIE_TIE14_Msk               (0x1U << MCAN_TXBTIE_TIE14_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 14 Mask */
#define MCAN_TXBTIE_TIE14                   MCAN_TXBTIE_TIE14_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE14_Msk instead */
#define MCAN_TXBTIE_TIE15_Pos               15                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 15 Position */
#define MCAN_TXBTIE_TIE15_Msk               (0x1U << MCAN_TXBTIE_TIE15_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 15 Mask */
#define MCAN_TXBTIE_TIE15                   MCAN_TXBTIE_TIE15_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE15_Msk instead */
#define MCAN_TXBTIE_TIE16_Pos               16                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 16 Position */
#define MCAN_TXBTIE_TIE16_Msk               (0x1U << MCAN_TXBTIE_TIE16_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 16 Mask */
#define MCAN_TXBTIE_TIE16                   MCAN_TXBTIE_TIE16_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE16_Msk instead */
#define MCAN_TXBTIE_TIE17_Pos               17                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 17 Position */
#define MCAN_TXBTIE_TIE17_Msk               (0x1U << MCAN_TXBTIE_TIE17_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 17 Mask */
#define MCAN_TXBTIE_TIE17                   MCAN_TXBTIE_TIE17_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE17_Msk instead */
#define MCAN_TXBTIE_TIE18_Pos               18                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 18 Position */
#define MCAN_TXBTIE_TIE18_Msk               (0x1U << MCAN_TXBTIE_TIE18_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 18 Mask */
#define MCAN_TXBTIE_TIE18                   MCAN_TXBTIE_TIE18_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE18_Msk instead */
#define MCAN_TXBTIE_TIE19_Pos               19                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 19 Position */
#define MCAN_TXBTIE_TIE19_Msk               (0x1U << MCAN_TXBTIE_TIE19_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 19 Mask */
#define MCAN_TXBTIE_TIE19                   MCAN_TXBTIE_TIE19_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE19_Msk instead */
#define MCAN_TXBTIE_TIE20_Pos               20                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 20 Position */
#define MCAN_TXBTIE_TIE20_Msk               (0x1U << MCAN_TXBTIE_TIE20_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 20 Mask */
#define MCAN_TXBTIE_TIE20                   MCAN_TXBTIE_TIE20_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE20_Msk instead */
#define MCAN_TXBTIE_TIE21_Pos               21                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 21 Position */
#define MCAN_TXBTIE_TIE21_Msk               (0x1U << MCAN_TXBTIE_TIE21_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 21 Mask */
#define MCAN_TXBTIE_TIE21                   MCAN_TXBTIE_TIE21_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE21_Msk instead */
#define MCAN_TXBTIE_TIE22_Pos               22                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 22 Position */
#define MCAN_TXBTIE_TIE22_Msk               (0x1U << MCAN_TXBTIE_TIE22_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 22 Mask */
#define MCAN_TXBTIE_TIE22                   MCAN_TXBTIE_TIE22_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE22_Msk instead */
#define MCAN_TXBTIE_TIE23_Pos               23                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 23 Position */
#define MCAN_TXBTIE_TIE23_Msk               (0x1U << MCAN_TXBTIE_TIE23_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 23 Mask */
#define MCAN_TXBTIE_TIE23                   MCAN_TXBTIE_TIE23_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE23_Msk instead */
#define MCAN_TXBTIE_TIE24_Pos               24                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 24 Position */
#define MCAN_TXBTIE_TIE24_Msk               (0x1U << MCAN_TXBTIE_TIE24_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 24 Mask */
#define MCAN_TXBTIE_TIE24                   MCAN_TXBTIE_TIE24_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE24_Msk instead */
#define MCAN_TXBTIE_TIE25_Pos               25                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 25 Position */
#define MCAN_TXBTIE_TIE25_Msk               (0x1U << MCAN_TXBTIE_TIE25_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 25 Mask */
#define MCAN_TXBTIE_TIE25                   MCAN_TXBTIE_TIE25_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE25_Msk instead */
#define MCAN_TXBTIE_TIE26_Pos               26                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 26 Position */
#define MCAN_TXBTIE_TIE26_Msk               (0x1U << MCAN_TXBTIE_TIE26_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 26 Mask */
#define MCAN_TXBTIE_TIE26                   MCAN_TXBTIE_TIE26_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE26_Msk instead */
#define MCAN_TXBTIE_TIE27_Pos               27                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 27 Position */
#define MCAN_TXBTIE_TIE27_Msk               (0x1U << MCAN_TXBTIE_TIE27_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 27 Mask */
#define MCAN_TXBTIE_TIE27                   MCAN_TXBTIE_TIE27_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE27_Msk instead */
#define MCAN_TXBTIE_TIE28_Pos               28                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 28 Position */
#define MCAN_TXBTIE_TIE28_Msk               (0x1U << MCAN_TXBTIE_TIE28_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 28 Mask */
#define MCAN_TXBTIE_TIE28                   MCAN_TXBTIE_TIE28_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE28_Msk instead */
#define MCAN_TXBTIE_TIE29_Pos               29                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 29 Position */
#define MCAN_TXBTIE_TIE29_Msk               (0x1U << MCAN_TXBTIE_TIE29_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 29 Mask */
#define MCAN_TXBTIE_TIE29                   MCAN_TXBTIE_TIE29_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE29_Msk instead */
#define MCAN_TXBTIE_TIE30_Pos               30                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 30 Position */
#define MCAN_TXBTIE_TIE30_Msk               (0x1U << MCAN_TXBTIE_TIE30_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 30 Mask */
#define MCAN_TXBTIE_TIE30                   MCAN_TXBTIE_TIE30_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE30_Msk instead */
#define MCAN_TXBTIE_TIE31_Pos               31                                             /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 31 Position */
#define MCAN_TXBTIE_TIE31_Msk               (0x1U << MCAN_TXBTIE_TIE31_Pos)                /**< (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 31 Mask */
#define MCAN_TXBTIE_TIE31                   MCAN_TXBTIE_TIE31_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_TXBTIE_TIE31_Msk instead */
#define MCAN_TXBTIE_TIE_Pos                 0                                              /**< (MCAN_TXBTIE Position) Transmission Interrupt Enable for Buffer 3x */
#define MCAN_TXBTIE_TIE_Msk                 (0xFFFFFFFFU << MCAN_TXBTIE_TIE_Pos)           /**< (MCAN_TXBTIE Mask) TIE */
#define MCAN_TXBTIE_TIE(value)              (MCAN_TXBTIE_TIE_Msk & ((value) << MCAN_TXBTIE_TIE_Pos))  
#define MCAN_TXBTIE_MASK                    (0xFFFFFFFFU)                                  /**< \deprecated (MCAN_TXBTIE) Register MASK  (Use MCAN_TXBTIE_Msk instead)  */
#define MCAN_TXBTIE_Msk                     (0xFFFFFFFFU)                                  /**< (MCAN_TXBTIE) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


